In [1]:
import pandas as pd 
import numpy as np
df=pd.read_csv('Studentdata.csv')
df

    Id   Name Class  Marks   Remarks
0  101  Owais   9th   -999  No Event
1  102  Bilal   8th     89      Pass
2  103   Zain   7th   -879  No Event
3  104  Noman   6th     75      Pass
4  105   Moiz   7th   -645  No Event
5  106   Saad   8th     80      Pass
6  107  Usama   5th   -999  No Event

In [2]:
newdf=df.replace([-999,-879,-645],np.NaN)
newdf

      Id   Name Class  Marks   Remarks
0  101.0  Owais   9th    NaN  No Event
1  102.0  Bilal   8th   89.0      Pass
2  103.0   Zain   7th    NaN  No Event
3  104.0  Noman   6th   75.0      Pass
4  105.0   Moiz   7th    NaN  No Event
5  106.0   Saad   8th   80.0      Pass
6  107.0  Usama   5th    NaN  No Event

In [3]:
newdf=df.replace({
    -999:np.NaN,
    -879:np.NaN,
    -645:np.NaN,
    'No Event':'Fail'
})
newdf

      Id   Name Class  Marks Remarks
0  101.0  Owais   9th    NaN    Fail
1  102.0  Bilal   8th   89.0    Pass
2  103.0   Zain   7th    NaN    Fail
3  104.0  Noman   6th   75.0    Pass
4  105.0   Moiz   7th    NaN    Fail
5  106.0   Saad   8th   80.0    Pass
6  107.0  Usama   5th    NaN    Fail

In [4]:
newdf=df.replace({
    'Class':'[A-Za-z]',
},'',regex=True)
newdf

    Id   Name Class  Marks   Remarks
0  101  Owais     9   -999  No Event
1  102  Bilal     8     89      Pass
2  103   Zain     7   -879  No Event
3  104  Noman     6     75      Pass
4  105   Moiz     7   -645  No Event
5  106   Saad     8     80      Pass
6  107  Usama     5   -999  No Event

In [10]:
newdf=df.replace(['No Event','Pass'],[0,1])
newdf

    Id   Name Class  Marks  Remarks
0  101  Owais   9th   -999        0
1  102  Bilal   8th     89        1
2  103   Zain   7th   -879        0
3  104  Noman   6th     75        1
4  105   Moiz   7th   -645        0
5  106   Saad   8th     80        1
6  107  Usama   5th   -999        0